chat_app_api/app/controllers/channels_controller.rb

  def index
    @channels = Channel.all
---
SELECT "channels".* FROM "channels"

  def create
    @channel = Channel.new(channel_params)

    if @channel.save
---
INSERT INTO "channels" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "room_one"], ["created_at", "2021-01-18 22:17:59.397069"], ["updated_at", "2021-01-18 22:17:59.397069"]]