chat_app_api/app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["password_digest", "$2a$12$i7Y2Oxl5I9W20zTWaf9k4OogXbonH9/EEsk9wiJpn/vvEY6Eu62xC"], ["created_at", "2021-01-18 00:07:14.100165"], ["updated_at", "2021-01-18 00:07:14.100165"]]
---
  def create
    @user = User.new(user_params)
    puts @user.username
    puts @user.password
      if @user.save